db_at = ['ดีพเลินนิ่ง', 'ทรานสเรชั่น', 'เด็กฝึกงาน', 'นิวเฮชซีไอ', 'เมตาเวิร์ส', 'เอ็นแอลพี', 'เฮลธ์แคร์', 'มิร์เรอร์', 'เทคโนโลยี', 'รู้เรื่อง', 'ไม่เข้าใจ', 'ผลิตภัณฑ์', 'คอนเซ็ปต์', 'สปีชทูเทค', 'เอ็นแอลยู', 'นวัตรกรรม', 'แนะนำตัว', 'ประโยชน์', 'เปิดเพลง', 'ร้องเพลง', 'โปรดักส์', 'แพลชชั่น', 'ก่อตั้ง', 'มายเซ็ต', 'ฮัลโหล ', 'เจ้าของ', 'ศักยภาพ', 'พี่น้อง', 'ข้อเสีย', 'ถึงชื่อ', 'ใช้ชื่อ', 'อยู่ไหม', 'อุปกรณ์', 'เอสซีจี', 'เดินทาง', 'เอสทีที', 'จุดเด่น', 'เอชซีไอ', 'สุดยอด', 'มากมาก', 'หล่ะคะ', 'ประกอบ', 'ใช้งาน', 'เข้าใจ', 'ได้ยิน', 'สบายดี', 'เป็นไง', 'รู้สึก', 'พูดได้', 'กี่โมง', 'กี่วัน', 'กี่บูธ', 'วันไหน', 'ท้าทาย', 'แชทบอท', 'ปลอบใจ', 'เทคซอส', 'คลาวด์', 'ยูทูป', 'รู้ใจ', 'กี่ปี', 'สร้าง', 'ข้อดี', 'กี่คน', 'โฟกัส', 'ทอล์ก', 'เอดจ์', 'เบื่อ', 'วีดู', 'เกิด', 'ราคา', 'หนัก', 'ญาติ', 'เก่ง', 'เป็น', 'ชื่อ', 'เจ๋ง', 'โชว์', 'บ้าน', 'what', 'เอไอ', 'ปลอบ', 'ขาย', 'คุย', 'สูง', 'ฟัง', 'แฟน', 'หิว', 'พูด', 'ของ', 'why', 'ทำ', 'สี']
db_kg = ['รู้ใจ', 'วีดู', 'เอนแอลพี', 'ปัญญาประดิษฐ์',  'บูธ', 'นิวเอชซีไอ', 'ไอโอที', 'ทีทีเอส', 'เอสทีที']
db_at.sort(key = len, reverse = True)
db_kg.sort(key = len, reverse = True)

#query word
q = 'ดูดี'

#calculate edit distance
import stringdist
A=[]
for i in db_kg:
    A.append(stringdist.levenshtein_norm(q,i))
index = A.index(min(A))
result = db_kg[index]